Pandas

Veri İşleme, Veri Temizleme, Veri Analizi, Veri Madenciliği ve Makine Öğrenimi gibi alanlarda sık kullanılır.

anaconda ile;
conda install pandas
pip ile;
pip install pandas

Pandas Serileri

In [2]:
import numpy as np
import pandas as pd

In [3]:
labels_list=["Onur","Ahmet","Murat","Kadir","Zeynep"]

In [4]:
data_list=[10,20,30,40,50]

In [5]:
pd.Series(data=data_list,index=labels_list)

Onur      10
Ahmet     20
Murat     30
Kadir     40
Zeynep    50
dtype: int64

In [6]:
pd.Series(data_list)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [7]:
pd.Series(labels_list)

0      Onur
1     Ahmet
2     Murat
3     Kadir
4    Zeynep
dtype: object

In [8]:
npArray=np.array([10,20,30,40,50])

In [9]:
pd.Series(npArray)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [10]:
pd.Series(npArray,labels_list)

Onur      10
Ahmet     20
Murat     30
Kadir     40
Zeynep    50
dtype: int64

In [11]:
pd.Series(data=npArray,index=["A","B","C","D","E"])

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [12]:
dataDict={"Kadir":30,"Kemal":80,"Kamuran":60}

In [16]:
pd.Series(dataDict)

Kadir      30
Kemal      80
Kamuran    60
dtype: int64

In [17]:
ser2017=pd.Series([5,10,14,20],["Buğday","Mısır","Kiraz","Erik"])

In [18]:
ser2017

Buğday     5
Mısır     10
Kiraz     14
Erik      20
dtype: int64

In [19]:
ser2018=pd.Series([2,12,12,6],["Buğday","Mısır","Çilek","Erik"])

In [21]:
ser2018

Buğday     2
Mısır     12
Çilek     12
Erik       6
dtype: int64

In [22]:
ser2017+ser2018

Buğday     7.0
Erik      26.0
Kiraz      NaN
Mısır     22.0
Çilek      NaN
dtype: float64

In [23]:
total=ser2017+ser2018

In [24]:
total

Buğday     7.0
Erik      26.0
Kiraz      NaN
Mısır     22.0
Çilek      NaN
dtype: float64

In [25]:
total["Erik"]

26.0

In [26]:
total["Çilek"]

nan

Dataframe Tanımlamaları

In [28]:
import numpy as np
import pandas as pd

In [29]:
from numpy.random import randn

In [31]:
randn(3)#sıfırın etrafında random değerler

array([0.16563629, 0.03120986, 1.60271286])

In [32]:
randn(3,3)

array([[ 0.51302618, -0.20224723, -1.11976905],
       [ 2.07255933, -0.281793  , -0.60050794],
       [-1.33669627,  1.76293276,  0.20414633]])

In [33]:
df=pd.DataFrame(data=randn(3,3),index=["A","B","C"],columns=["Column1","Column2","Column3"])

In [34]:
df

    Column1   Column2   Column3
A  0.352821  0.217662 -0.706176
B -1.042110  1.028301 -0.383895
C  0.732515  0.792948  0.665996

In [35]:
df["Column1"]

A    0.352821
B   -1.042110
C    0.732515
Name: Column1, dtype: float64

In [36]:
type(df["Column2"])

pandas.core.series.Series

In [37]:
#dataframes serilerin birleşimidir.

In [38]:
df.loc["A"]#index değerine göre sorgulama

Column1    0.352821
Column2    0.217662
Column3   -0.706176
Name: A, dtype: float64

In [41]:
df[["Column1","Column3"]]

    Column1   Column3
A  0.352821 -0.706176
B -1.042110 -0.383895
C  0.732515  0.665996

In [42]:
df

    Column1   Column2   Column3
A  0.352821  0.217662 -0.706176
B -1.042110  1.028301 -0.383895
C  0.732515  0.792948  0.665996

In [43]:
df["Column4"]=pd.Series(randn(3),["A","B","C"])

In [44]:
df

    Column1   Column2   Column3   Column4
A  0.352821  0.217662 -0.706176  1.014223
B -1.042110  1.028301 -0.383895 -0.108551
C  0.732515  0.792948  0.665996  0.875926

In [45]:
df["Column5"]=df["Column1"]+df["Column2"]+df["Column3"]

In [46]:
df

    Column1   Column2   Column3   Column4   Column5
A  0.352821  0.217662 -0.706176  1.014223 -0.135693
B -1.042110  1.028301 -0.383895 -0.108551 -0.397704
C  0.732515  0.792948  0.665996  0.875926  2.191458

In [49]:
df.drop("Column5",axis=1)#yatay 0 dikey 1

    Column1   Column2   Column3   Column4
A  0.352821  0.217662 -0.706176  1.014223
B -1.042110  1.028301 -0.383895 -0.108551
C  0.732515  0.792948  0.665996  0.875926

In [50]:
df

    Column1   Column2   Column3   Column4   Column5
A  0.352821  0.217662 -0.706176  1.014223 -0.135693
B -1.042110  1.028301 -0.383895 -0.108551 -0.397704
C  0.732515  0.792948  0.665996  0.875926  2.191458

In [51]:
df.drop("Column5",axis=1,inplace=True)#yatay 0 dikey 1

In [52]:
df

    Column1   Column2   Column3   Column4
A  0.352821  0.217662 -0.706176  1.014223
B -1.042110  1.028301 -0.383895 -0.108551
C  0.732515  0.792948  0.665996  0.875926

In [53]:
df["Column1"]

A    0.352821
B   -1.042110
C    0.732515
Name: Column1, dtype: float64

In [54]:
df.loc["A"]

Column1    0.352821
Column2    0.217662
Column3   -0.706176
Column4    1.014223
Name: A, dtype: float64

In [55]:
df.iloc[0]

Column1    0.352821
Column2    0.217662
Column3   -0.706176
Column4    1.014223
Name: A, dtype: float64

In [56]:
df.loc["A","Column1"]

0.35282132150284407

In [57]:
df.loc["B","Column2"]

1.0283006099878231

In [58]:
df.loc[["A","B"],["Column1","Column2"]]

    Column1   Column2
A  0.352821  0.217662
B -1.042110  1.028301

Dataframe Filtreleme

In [2]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [3]:
df=pd.DataFrame(randn(4,3),["A","B","C","D"],["Column1","Column2","Column3"])

In [4]:
df

    Column1   Column2   Column3
A -0.202142  0.709123 -0.039054
B  1.611254 -2.278236 -0.778279
C  0.009673  0.524963  0.098500
D  0.078239 -0.670100  0.143153

In [5]:
df > -1

   Column1  Column2  Column3
A     True     True     True
B     True    False     True
C     True     True     True
D     True     True     True

In [6]:
df>0

   Column1  Column2  Column3
A    False     True    False
B     True    False    False
C     True     True     True
D     True    False     True

In [7]:
booleandDf=df>0

In [8]:
booleandDf

   Column1  Column2  Column3
A    False     True    False
B     True    False    False
C     True     True     True
D     True    False     True

In [9]:
df[booleandDf]

    Column1   Column2   Column3
A       NaN  0.709123       NaN
B  1.611254       NaN       NaN
C  0.009673  0.524963  0.098500
D  0.078239       NaN  0.143153

In [11]:
df[df>-1]

    Column1   Column2   Column3
A -0.202142  0.709123 -0.039054
B  1.611254       NaN -0.778279
C  0.009673  0.524963  0.098500
D  0.078239 -0.670100  0.143153

In [12]:
df

    Column1   Column2   Column3
A -0.202142  0.709123 -0.039054
B  1.611254 -2.278236 -0.778279
C  0.009673  0.524963  0.098500
D  0.078239 -0.670100  0.143153

In [13]:
df["Column1"]

A   -0.202142
B    1.611254
C    0.009673
D    0.078239
Name: Column1, dtype: float64

In [14]:
df["Column1"]>0

A    False
B     True
C     True
D     True
Name: Column1, dtype: bool

In [16]:
df[df["Column1"]>0]

    Column1   Column2   Column3
B  1.611254 -2.278236 -0.778279
C  0.009673  0.524963  0.098500
D  0.078239 -0.670100  0.143153

In [18]:
df["Column1"]>0.5

A    False
B     True
C    False
D    False
Name: Column1, dtype: bool

In [19]:
df[df["Column1"]>0.5]

    Column1   Column2   Column3
B  1.611254 -2.278236 -0.778279

In [21]:
df[df["Column1"]>0]

    Column1   Column2   Column3
B  1.611254 -2.278236 -0.778279
C  0.009673  0.524963  0.098500
D  0.078239 -0.670100  0.143153

In [22]:
df[df["Column2"]>0]

    Column1   Column2   Column3
A -0.202142  0.709123 -0.039054
C  0.009673  0.524963  0.098500

In [24]:
df[(df["Column1"]>0) & (df["Column2"]>0) ]#ve bağlacı

    Column1   Column2  Column3
C  0.009673  0.524963   0.0985

In [25]:
df[(df["Column1"]>0) | (df["Column2"]>0) ]#or bağlacı

    Column1   Column2   Column3
A -0.202142  0.709123 -0.039054
B  1.611254 -2.278236 -0.778279
C  0.009673  0.524963  0.098500
D  0.078239 -0.670100  0.143153

In [26]:
df

    Column1   Column2   Column3
A -0.202142  0.709123 -0.039054
B  1.611254 -2.278236 -0.778279
C  0.009673  0.524963  0.098500
D  0.078239 -0.670100  0.143153

In [27]:
df["Column4"]=pd.Series(randn(4),["A","B","C","D"])

In [28]:
df

    Column1   Column2   Column3   Column4
A -0.202142  0.709123 -0.039054  1.048535
B  1.611254 -2.278236 -0.778279 -1.277993
C  0.009673  0.524963  0.098500 -0.697611
D  0.078239 -0.670100  0.143153  0.840787

In [29]:
df["Column5"]=randn(4)

In [30]:
df

    Column1   Column2   Column3   Column4   Column5
A -0.202142  0.709123 -0.039054  1.048535  1.529290
B  1.611254 -2.278236 -0.778279 -1.277993 -0.111759
C  0.009673  0.524963  0.098500 -0.697611  0.192441
D  0.078239 -0.670100  0.143153  0.840787 -0.196447

In [31]:
df["Column6"]=["newValue1","newValue2","newValue3","newValue4"]

In [32]:
df

    Column1   Column2   Column3   Column4   Column5    Column6
A -0.202142  0.709123 -0.039054  1.048535  1.529290  newValue1
B  1.611254 -2.278236 -0.778279 -1.277993 -0.111759  newValue2
C  0.009673  0.524963  0.098500 -0.697611  0.192441  newValue3
D  0.078239 -0.670100  0.143153  0.840787 -0.196447  newValue4

In [34]:
df.set_index("Column6")

            Column1   Column2   Column3   Column4   Column5
Column6
newValue1 -0.202142  0.709123 -0.039054  1.048535  1.529290
newValue2  1.611254 -2.278236 -0.778279 -1.277993 -0.111759
newValue3  0.009673  0.524963  0.098500 -0.697611  0.192441
newValue4  0.078239 -0.670100  0.143153  0.840787 -0.196447

In [35]:
df

    Column1   Column2   Column3   Column4   Column5    Column6
A -0.202142  0.709123 -0.039054  1.048535  1.529290  newValue1
B  1.611254 -2.278236 -0.778279 -1.277993 -0.111759  newValue2
C  0.009673  0.524963  0.098500 -0.697611  0.192441  newValue3
D  0.078239 -0.670100  0.143153  0.840787 -0.196447  newValue4

In [36]:
df.set_index("Column6",inplace=True)

In [37]:
df

            Column1   Column2   Column3   Column4   Column5
Column6
newValue1 -0.202142  0.709123 -0.039054  1.048535  1.529290
newValue2  1.611254 -2.278236 -0.778279 -1.277993 -0.111759
newValue3  0.009673  0.524963  0.098500 -0.697611  0.192441
newValue4  0.078239 -0.670100  0.143153  0.840787 -0.196447

In [38]:
df.index.names

FrozenList(['Column6'])

In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
outerIndex=["Group1","Group1","Group1","Group2","Group2","Group2","Group3","Group3","Group3"]

In [3]:
innerIndex=["Index1","Index2","Index3","Index1","Index2","Index3","Index1","Index2","Index3"]

In [6]:
list(zip(outerIndex,innerIndex))

[('Group1', 'Index1'),
 ('Group1', 'Index2'),
 ('Group1', 'Index3'),
 ('Group2', 'Index1'),
 ('Group2', 'Index2'),
 ('Group2', 'Index3'),
 ('Group3', 'Index1'),
 ('Group3', 'Index2'),
 ('Group3', 'Index3')]

In [7]:
hierarchy=list(zip(outerIndex,innerIndex))

In [8]:
hierarchy=pd.MultiIndex.from_tuples(hierarchy)

In [9]:
hierarchy

MultiIndex(levels=[['Group1', 'Group2', 'Group3'], ['Index1', 'Index2', 'Index3']],
           codes=[[0, 0, 0, 1, 1, 1, 2, 2, 2], [0, 1, 2, 0, 1, 2, 0, 1, 2]])

In [17]:
df=pd.DataFrame(randn(9,3),hierarchy,columns=["Column1","Column2","Column3"])

In [18]:
df

                Column1   Column2   Column3
Group1 Index1 -0.242967 -0.122493 -0.898950
       Index2 -1.155275 -0.534953 -1.440021
       Index3 -1.004605 -2.352213 -1.163363
Group2 Index1 -1.409039  2.019624 -0.744713
       Index2 -1.355163 -0.564431  1.057817
       Index3  0.038280 -0.096608  0.890491
Group3 Index1 -0.427701  0.059759 -1.168147
       Index2  0.565666 -0.607458  0.983547
       Index3  0.643733  1.381997  0.803247

In [19]:
df["Column1"]

Group1  Index1   -0.242967
        Index2   -1.155275
        Index3   -1.004605
Group2  Index1   -1.409039
        Index2   -1.355163
        Index3    0.038280
Group3  Index1   -0.427701
        Index2    0.565666
        Index3    0.643733
Name: Column1, dtype: float64

In [20]:
df.loc["Group1"]

         Column1   Column2   Column3
Index1 -0.242967 -0.122493 -0.898950
Index2 -1.155275 -0.534953 -1.440021
Index3 -1.004605 -2.352213 -1.163363

In [21]:
df.loc[["Group1","Group2"]]

                Column1   Column2   Column3
Group1 Index1 -0.242967 -0.122493 -0.898950
       Index2 -1.155275 -0.534953 -1.440021
       Index3 -1.004605 -2.352213 -1.163363
Group2 Index1 -1.409039  2.019624 -0.744713
       Index2 -1.355163 -0.564431  1.057817
       Index3  0.038280 -0.096608  0.890491

In [23]:
df.loc["Group1"].loc["Index1"]

Column1   -0.242967
Column2   -0.122493
Column3   -0.898950
Name: Index1, dtype: float64

In [24]:
df.loc["Group1"].loc["Index1"].loc["Column1"]

-0.24296709368173508

In [25]:
df.index.names

FrozenList([None, None])

In [26]:
df.index.names=["Groups","Indexes"]

In [27]:
df

                 Column1   Column2   Column3
Groups Indexes
Group1 Index1  -0.242967 -0.122493 -0.898950
       Index2  -1.155275 -0.534953 -1.440021
       Index3  -1.004605 -2.352213 -1.163363
Group2 Index1  -1.409039  2.019624 -0.744713
       Index2  -1.355163 -0.564431  1.057817
       Index3   0.038280 -0.096608  0.890491
Group3 Index1  -0.427701  0.059759 -1.168147
       Index2   0.565666 -0.607458  0.983547
       Index3   0.643733  1.381997  0.803247

In [28]:
df.loc["Group1"]

          Column1   Column2   Column3
Indexes
Index1  -0.242967 -0.122493 -0.898950
Index2  -1.155275 -0.534953 -1.440021
Index3  -1.004605 -2.352213 -1.163363

In [29]:
df.xs("Group1")

          Column1   Column2   Column3
Indexes
Index1  -0.242967 -0.122493 -0.898950
Index2  -1.155275 -0.534953 -1.440021
Index3  -1.004605 -2.352213 -1.163363

In [31]:
df.xs("Group1").xs("Index1")

Column1   -0.242967
Column2   -0.122493
Column3   -0.898950
Name: Index1, dtype: float64

In [32]:
df.xs("Index1",level="Indexes")

         Column1   Column2   Column3
Groups
Group1 -0.242967 -0.122493 -0.898950
Group2 -1.409039  2.019624 -0.744713
Group3 -0.427701  0.059759 -1.168147

Kayıp ve Bozuk Veriler

In [1]:
import numpy as np
import pandas as pd

In [2]:
arr=np.array([[10,20,np.nan],[5,np.nan,np.nan],[21,np.nan,10]])

In [3]:
arr

array([[10., 20., nan],
       [ 5., nan, nan],
       [21., nan, 10.]])

In [4]:
df=pd.DataFrame(arr,index=["Index1","Index2","Index3"],columns=["Column1","Column2","Column3"])

In [5]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [6]:
df.dropna()#axis 0 ise indexe gore 1 ise column a göre siler

Empty DataFrame
Columns: [Column1, Column2, Column3]
Index: []

In [7]:
df.dropna(axis=1)

        Column1
Index1     10.0
Index2      5.0
Index3     21.0

In [8]:
df.dropna(thresh=2)

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index3     21.0      NaN     10.0

In [10]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [12]:
df.fillna(value=1)

        Column1  Column2  Column3
Index1     10.0     20.0      1.0
Index2      5.0      1.0      1.0
Index3     21.0      1.0     10.0

In [13]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [14]:
df.sum()

Column1    36.0
Column2    20.0
Column3    10.0
dtype: float64

In [15]:
df.sum().sum()

66.0

In [16]:
df.size

9

In [19]:
df.isnull().sum()

Column1    0
Column2    2
Column3    2
dtype: int64

In [20]:
df.isnull().sum().sum()

4

In [21]:
def calculateMean(df):
    totalSum=df.sum().sum()
    totalNum=df.size-df.isnull().sum().sum()
    return totalSum/totalNum

In [22]:
df.fillna(value=calculateMean(df))

        Column1  Column2  Column3
Index1     10.0     20.0     13.2
Index2      5.0     13.2     13.2
Index3     21.0     13.2     10.0

In [23]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [24]:
df.fillna(value=calculateMean(df),inplace=True)

In [25]:
df

        Column1  Column2  Column3
Index1     10.0     20.0     13.2
Index2      5.0     13.2     13.2
Index3     21.0     13.2     10.0

Groupby Operasyonu

In [1]:
import numpy as np
import pandas as pd

In [6]:
dataset = {
        "Departman":["Bilişim","İnsan Kaynakları","Üretim","Üretim","Bilişim","İnsan Kaynakları"],
        "Maaş":[3000,3500,2500,4500,4000,2000],
        "Çalışan": ["Mustafa","Jale","Kadir","Zeynep","Murat","Ahmet"]
        }

In [7]:
dataset

{'Departman': ['Bilişim',
  'İnsan Kaynakları',
  'Üretim',
  'Üretim',
  'Bilişim',
  'İnsan Kaynakları'],
 'Maaş': [3000, 3500, 2500, 4500, 4000, 2000],
 'Çalışan': ['Mustafa', 'Jale', 'Kadir', 'Zeynep', 'Murat', 'Ahmet']}

In [8]:
df=pd.DataFrame(dataset)

In [9]:
df

          Departman  Maaş  Çalışan
0           Bilişim  3000  Mustafa
1  İnsan Kaynakları  3500     Jale
2            Üretim  2500    Kadir
3            Üretim  4500   Zeynep
4           Bilişim  4000    Murat
5  İnsan Kaynakları  2000    Ahmet

In [12]:
DepGroup=df.groupby("Departman")#Departmana göre groupby işlemi

In [13]:
DepGroup

In [14]:
DepGroup.sum()

                  Maaş
Departman
Bilişim           7000
Üretim            7000
İnsan Kaynakları  5500

In [15]:
df.groupby("Departman").sum()

                  Maaş
Departman
Bilişim           7000
Üretim            7000
İnsan Kaynakları  5500

In [16]:
df.groupby("Departman").sum().loc["Bilişim"]

Maaş    7000
Name: Bilişim, dtype: int64

In [17]:
df.groupby("Departman").count()

                  Maaş  Çalışan
Departman
Bilişim              2        2
Üretim               2        2
İnsan Kaynakları     2        2

In [18]:
df.groupby("Departman").max()

                  Maaş  Çalışan
Departman
Bilişim           4000  Mustafa
Üretim            4500   Zeynep
İnsan Kaynakları  3500     Jale

In [19]:
df.groupby("Departman").min()

                  Maaş Çalışan
Departman
Bilişim           3000   Murat
Üretim            2500   Kadir
İnsan Kaynakları  2000   Ahmet

In [20]:
df.groupby("Departman").min()["Maaş"]

Departman
Bilişim             3000
Üretim              2500
İnsan Kaynakları    2000
Name: Maaş, dtype: int64

In [21]:
df.groupby("Departman").min()["Maaş"]["Bilişim"]

3000

In [22]:
df.groupby("Departman").mean()#ortalama maaşları

                  Maaş
Departman
Bilişim           3500
Üretim            3500
İnsan Kaynakları  2750

In [23]:
df.groupby("Departman").mean()["Maaş"]["İnsan Kaynakları"]

2750

Merge,Join ve Concatenate

Concatenation #dataframe leri birbirine ekleme

In [1]:
import numpy as np
import pandas as pd

In [2]:
dataset1={
    "A":["A1","A2","A3","A4"],
    "B":["B1","B2","B3","B4"],
    "C":["C1","C2","C3","C4"],
}

dataset2={
    "A":["A5","A6","A7","A8"],
    "B":["B5","B6","B7","B8"],
    "C":["C5","C6","C7","C8"],
}
df1=pd.DataFrame(dataset1,index=[1,2,3,4])
df2=pd.DataFrame(dataset2,index=[5,6,7,8])

In [3]:
df1

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4

In [4]:
df2

    A   B   C
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [5]:
pd.concat([df1,df2])

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [7]:
pd.concat([df1,df2],axis=1)

     A    B    C    A    B    C
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN
3   A3   B3   C3  NaN  NaN  NaN
4   A4   B4   C4  NaN  NaN  NaN
5  NaN  NaN  NaN   A5   B5   C5
6  NaN  NaN  NaN   A6   B6   C6
7  NaN  NaN  NaN   A7   B7   C7
8  NaN  NaN  NaN   A8   B8   C8

# join

In [10]:
dataset1={
    "A":["A1","A2","A3","A4"],
    "B":["B1","B2","B3","A4"],
}
dataset2={
    "X":["X1","X2","X3"],
    "Y":["Y1","Y2","Y3"],
}

df1=pd.DataFrame(dataset1,index=[1,2,3,4])
df2=pd.DataFrame(dataset2,index=[1,2,3])

In [11]:
df1

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  A4

In [12]:
df2

    X   Y
1  X1  Y1
2  X2  Y2
3  X3  Y3

In [13]:
df1.join(df2)

    A   B    X    Y
1  A1  B1   X1   Y1
2  A2  B2   X2   Y2
3  A3  B3   X3   Y3
4  A4  A4  NaN  NaN

In [14]:
df2.join(df1)

    X   Y   A   B
1  X1  Y1  A1  B1
2  X2  Y2  A2  B2
3  X3  Y3  A3  B3

# Merge

Ortak değerlerin olduğu df
join indexler üzerinden merge columns üzerinden

In [18]:
dataset1={
    "A":["A1","A2","A3"],
    "B":["B1","B2","B3"],
    "anahtar":["K1","K2","K3"]
}

dataset2={
    "X":["X1","X2","X3","X4"],
    "Y":["Y1","Y2","Y3","Y4"],
    "anahtar":["K1","K2","K5","K4"]
}
df1=pd.DataFrame(dataset1,index=[1,2,3])
df2=pd.DataFrame(dataset2,index=[1,2,3,4])

In [19]:
df1

    A   B anahtar
1  A1  B1      K1
2  A2  B2      K2
3  A3  B3      K3

In [20]:
df2

    X   Y anahtar
1  X1  Y1      K1
2  X2  Y2      K2
3  X3  Y3      K5
4  X4  Y4      K4

In [22]:
pd.merge(df1,df2,on="anahtar")   #anahtara göre merge

    A   B anahtar   X   Y
0  A1  B1      K1  X1  Y1
1  A2  B2      K2  X2  Y2

# DataFrame Operasyonları

In [23]:
import numpy as np
import pandas as pd

In [24]:
df=pd.DataFrame({
    "Column1":[1,2,3,4,5,6],
    "Column2":[100,100,200,300,300,100],
    "Column3":["Mustafa","Kamil","Emre","Ayşe","Murat","Zeynep"]
})

In [25]:
df

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre
3        4      300     Ayşe
4        5      300    Murat
5        6      100   Zeynep

In [26]:
df.head()

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre
3        4      300     Ayşe
4        5      300    Murat

In [27]:
df.head(n=3)

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre

In [28]:
df["Column2"].unique()#column 2 eşşiz değerleri

array([100, 200, 300])

In [29]:
df["Column2"].nunique()

3

In [32]:
df["Column2"].value_counts()#değerlerden kaç tane olduğunu gösterir

100    3
300    2
200    1
Name: Column2, dtype: int64

In [35]:
df[(df["Column1"]>=4) & (df["Column2"]==300)]#Column1 de 4 ten büyük eşit ve 300 olanlar

   Column1  Column2 Column3
3        4      300    Ayşe
4        5      300   Murat

In [36]:
df

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre
3        4      300     Ayşe
4        5      300    Murat
5        6      100   Zeynep

In [37]:
#column2 dekilerin hepsini 3 ile çarp
def times3(x):
    return x*3

In [38]:
times3(5)

15

In [39]:
df["Column2"].apply(times3)#apply ile fonksiyon verdik

0    300
1    300
2    600
3    900
4    900
5    300
Name: Column2, dtype: int64

In [40]:
df["Column2"]=df["Column2"].apply(times3)

In [41]:
df

   Column1  Column2  Column3
0        1      300  Mustafa
1        2      300    Kamil
2        3      600     Emre
3        4      900     Ayşe
4        5      900    Murat
5        6      300   Zeynep

In [42]:
df["Column2"].apply(lambda x : x*2 )

0     600
1     600
2    1200
3    1800
4    1800
5     600
Name: Column2, dtype: int64

In [46]:
df["Column3"].apply(len)

0    7
1    5
2    4
3    4
4    5
5    6
Name: Column3, dtype: int64

In [47]:
df.drop("Column3",axis=1)

   Column1  Column2
0        1      300
1        2      300
2        3      600
3        4      900
4        5      900
5        6      300

In [48]:
df

   Column1  Column2  Column3
0        1      300  Mustafa
1        2      300    Kamil
2        3      600     Emre
3        4      900     Ayşe
4        5      900    Murat
5        6      300   Zeynep

In [49]:
df.drop("Column3",axis=1,inplace=True)

In [50]:
df

   Column1  Column2
0        1      300
1        2      300
2        3      600
3        4      900
4        5      900
5        6      300

In [52]:
df.columns# kaç tane sütun

Index(['Column1', 'Column2'], dtype='object')

In [53]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [54]:
len(df.index)

6

In [56]:
df.index.names#indexlerin ismi

FrozenList([None])

In [57]:
df

   Column1  Column2
0        1      300
1        2      300
2        3      600
3        4      900
4        5      900
5        6      300

In [58]:
df.sort_values("Column2",ascending=False)#büyükten küçüğe sırala column2 yi

   Column1  Column2
3        4      900
4        5      900
2        3      600
0        1      300
1        2      300
5        6      300

In [59]:
df

   Column1  Column2
0        1      300
1        2      300
2        3      600
3        4      900
4        5      900
5        6      300

In [63]:
df = pd.DataFrame({
    "Ay" : ["Mart","Nisan","Mayıs","Mart","Nisan","Mayıs","Mart","Nisan","Mayıs"],
    "Nem":[10,25,50,21,67,80,30,70,75],
    "Şehir":["Ankara","Ankara","Ankara","İstanbul","İstanbul","İstanbul","İzmir","İzmir","İzmir"]
    
})

In [64]:
df

      Ay  Nem     Şehir
0   Mart   10    Ankara
1  Nisan   25    Ankara
2  Mayıs   50    Ankara
3   Mart   21  İstanbul
4  Nisan   67  İstanbul
5  Mayıs   80  İstanbul
6   Mart   30     İzmir
7  Nisan   70     İzmir
8  Mayıs   75     İzmir

In [65]:
df.pivot_table(index="Ay",columns="Şehir",values="Nem")

Şehir  Ankara  İstanbul  İzmir
Ay
Mart       10        21     30
Mayıs      50        80     75
Nisan      25        67     70